RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_dma.h
/**
 **************************************************************************
 * File Name    : at32f4xx_dma.h
 * Description  : at32f4xx DMA header file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_DMA_H
#define __AT32F4xx_DMA_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup DMA
  * @{
  */

/** @defgroup DMA_Exported_Types
  * @{
  */

/**
  * @brief  DMA Init structure definition
  */

typedef struct
{
    uint32_t DMA_PeripheralBaseAddr;        /*!< Specifies the peripheral base address for DMAy Channelx. */

    uint32_t DMA_MemoryBaseAddr;            /*!< Specifies the memory base address for DMAy Channelx. */

    uint32_t DMA_Direction;                 /*!< Specifies if the peripheral is the source or destination.
                                               This parameter can be a value of @ref DMA_data_transfer_direction */

    uint32_t DMA_BufferSize;                /*!< Specifies the buffer size, in data unit, of the specified Channel.
                                               The data unit is equal to the configuration set in DMA_PeripheralDataWidth
                                               or DMA_MemoryDataWidth members depending in the transfer direction. */

    uint32_t DMA_PeripheralInc;             /*!< Specifies whether the Peripheral address register is incremented or not.
                                               This parameter can be a value of @ref DMA_peripheral_incremented_mode */

    uint32_t DMA_MemoryInc;                 /*!< Specifies whether the memory address register is incremented or not.
                                               This parameter can be a value of @ref DMA_memory_incremented_mode */

    uint32_t DMA_PeripheralDataWidth;       /*!< Specifies the Peripheral data width.
                                               This parameter can be a value of @ref DMA_peripheral_data_size */

    uint32_t DMA_MemoryDataWidth;           /*!< Specifies the Memory data width.
                                               This parameter can be a value of @ref DMA_memory_data_size */

    uint32_t DMA_Mode;                      /*!< Specifies the operation mode of the DMAy Channelx.
                                               This parameter can be a value of @ref DMA_circular_normal_mode.
                                               @note: The circular buffer mode cannot be used if the memory-to-memory
                                                     data transfer is configured on the selected Channel */

    uint32_t DMA_Priority;                  /*!< Specifies the software priority for the DMAy Channelx.
                                               This parameter can be a value of @ref DMA_priority_level */

    uint32_t DMA_MTOM;                      /*!< Specifies if the DMAy Channelx will be used in memory-to-memory transfer.
                                               This parameter can be a value of @ref DMA_memory_to_memory */
} DMA_InitType;

/**
  * @}
  */

/** @defgroup DMA_Exported_Constants
  * @{
  */

#define IS_DMA_ALL_PERIPH(PERIPH)           (((PERIPH) == DMA1_Channel1) || \
                                             ((PERIPH) == DMA1_Channel2) || \
                                             ((PERIPH) == DMA1_Channel3) || \
                                             ((PERIPH) == DMA1_Channel4) || \
                                             ((PERIPH) == DMA1_Channel5) || \
                                             ((PERIPH) == DMA1_Channel6) || \
                                             ((PERIPH) == DMA1_Channel7) || \
                                             ((PERIPH) == DMA2_Channel1) || \
                                             ((PERIPH) == DMA2_Channel2) || \
                                             ((PERIPH) == DMA2_Channel3) || \
                                             ((PERIPH) == DMA2_Channel4) || \
                                             ((PERIPH) == DMA2_Channel5))


/** @defgroup DMA_flexible_channel
  * @{
  */
#define Flex_Channel1          ((uint8_t)0x01)
#define Flex_Channel2          ((uint8_t)0x02)
#define Flex_Channel3          ((uint8_t)0x03)
#define Flex_Channel4          ((uint8_t)0x04)
#define Flex_Channel5          ((uint8_t)0x05)
#define Flex_Channel6          ((uint8_t)0x06)
#define Flex_Channel7          ((uint8_t)0x07)

#define IS_DMA_ALL_CHANNELS(CHANNELS)     (((CHANNELS) == Flex_Channel1) || \
                                           ((CHANNELS) == Flex_Channel2) || \
                                           ((CHANNELS) == Flex_Channel3) || \
                                           ((CHANNELS) == Flex_Channel4) || \
                                           ((CHANNELS) == Flex_Channel5) || \
                                           ((CHANNELS) == Flex_Channel6) || \
                                           ((CHANNELS) == Flex_Channel7))

/** @defgroup DMA_hardware_id
  * @{
  */
#define DMA_FLEXIBLE_ADC1           ((uint8_t)0x01)
#define DMA_FLEXIBLE_ADC3           ((uint8_t)0x03)
#define DMA_FLEXIBLE_DAC1           ((uint8_t)0x05)
#define DMA_FLEXIBLE_DAC2           ((uint8_t)0x06)
#define DMA_FLEXIBLE_SPI1_RX        ((uint8_t)0x09)
#define DMA_FLEXIBLE_SPI1_TX        ((uint8_t)0x0A)
#define DMA_FLEXIBLE_SPI2_RX        ((uint8_t)0x0B)
#define DMA_FLEXIBLE_SPI2_TX        ((uint8_t)0x0C)
#define DMA_FLEXIBLE_SPI3_RX        ((uint8_t)0x0D)
#define DMA_FLEXIBLE_SPI3_TX        ((uint8_t)0x0E)
#define DMA_FLEXIBLE_SPI4_RX        ((uint8_t)0x0F)
#define DMA_FLEXIBLE_SPI4_TX        ((uint8_t)0x10)
#define DMA_FLEXIBLE_I2S2EXT_RX     ((uint8_t)0x11)
#define DMA_FLEXIBLE_I2S2EXT_TX     ((uint8_t)0x12)
#define DMA_FLEXIBLE_I2S3EXT_RX     ((uint8_t)0x13)
#define DMA_FLEXIBLE_I2S3EXT_TX     ((uint8_t)0x14)
#define DMA_FLEXIBLE_UART1_RX       ((uint8_t)0x19)
#define DMA_FLEXIBLE_UART1_TX       ((uint8_t)0x1A)
#define DMA_FLEXIBLE_UART2_RX       ((uint8_t)0x1B)
#define DMA_FLEXIBLE_UART2_TX       ((uint8_t)0x1C)
#define DMA_FLEXIBLE_UART3_RX       ((uint8_t)0x1D)
#define DMA_FLEXIBLE_UART3_TX       ((uint8_t)0x1E)
#define DMA_FLEXIBLE_UART4_RX       ((uint8_t)0x1F)
#define DMA_FLEXIBLE_UART4_TX       ((uint8_t)0x20)
#define DMA_FLEXIBLE_UART5_RX       ((uint8_t)0x21)
#define DMA_FLEXIBLE_UART5_TX       ((uint8_t)0x22)
#define DMA_FLEXIBLE_UART6_RX       ((uint8_t)0x23)
#define DMA_FLEXIBLE_UART6_TX       ((uint8_t)0x24)
#define DMA_FLEXIBLE_UART7_RX       ((uint8_t)0x25)
#define DMA_FLEXIBLE_UART7_TX       ((uint8_t)0x26)
#define DMA_FLEXIBLE_UART8_RX       ((uint8_t)0x27)
#define DMA_FLEXIBLE_UART8_TX       ((uint8_t)0x28)
#define DMA_FLEXIBLE_I2C1_RX        ((uint8_t)0x29)
#define DMA_FLEXIBLE_I2C1_TX        ((uint8_t)0x2A)
#define DMA_FLEXIBLE_I2C2_RX        ((uint8_t)0x2B)
#define DMA_FLEXIBLE_I2C2_TX        ((uint8_t)0x2C)
#define DMA_FLEXIBLE_I2C3_RX        ((uint8_t)0x2D)
#define DMA_FLEXIBLE_I2C3_TX        ((uint8_t)0x2E)
#define DMA_FLEXIBLE_SDIO1          ((uint8_t)0x31)
#define DMA_FLEXIBLE_SDIO2          ((uint8_t)0x32)
#define DMA_FLEXIBLE_TIM1_TRIG      ((uint8_t)0x35)
#define DMA_FLEXIBLE_TIM1_COM       ((uint8_t)0x36)
#define DMA_FLEXIBLE_TIM1_UP        ((uint8_t)0x37)
#define DMA_FLEXIBLE_TIM1_CH1       ((uint8_t)0x38)
#define DMA_FLEXIBLE_TIM1_CH2       ((uint8_t)0x39)
#define DMA_FLEXIBLE_TIM1_CH3       ((uint8_t)0x3A)
#define DMA_FLEXIBLE_TIM1_CH4       ((uint8_t)0x3B)
#define DMA_FLEXIBLE_TIM2_TRIG      ((uint8_t)0x3D)
#define DMA_FLEXIBLE_TIM2_UP        ((uint8_t)0x3F)
#define DMA_FLEXIBLE_TIM2_CH1       ((uint8_t)0x40)
#define DMA_FLEXIBLE_TIM2_CH2       ((uint8_t)0x41)
#define DMA_FLEXIBLE_TIM2_CH3       ((uint8_t)0x42)
#define DMA_FLEXIBLE_TIM2_CH4       ((uint8_t)0x43)
#define DMA_FLEXIBLE_TIM3_TRIG      ((uint8_t)0x45)
#define DMA_FLEXIBLE_TIM3_UP        ((uint8_t)0x47)
#define DMA_FLEXIBLE_TIM3_CH1       ((uint8_t)0x48)
#define DMA_FLEXIBLE_TIM3_CH2       ((uint8_t)0x49)
#define DMA_FLEXIBLE_TIM3_CH3       ((uint8_t)0x4A)
#define DMA_FLEXIBLE_TIM3_CH4       ((uint8_t)0x4B)
#define DMA_FLEXIBLE_TIM4_TRIG      ((uint8_t)0x4D)
#define DMA_FLEXIBLE_TIM4_UP        ((uint8_t)0x4F)
#define DMA_FLEXIBLE_TIM4_CH1       ((uint8_t)0x50)
#define DMA_FLEXIBLE_TIM4_CH2       ((uint8_t)0x51)
#define DMA_FLEXIBLE_TIM4_CH3       ((uint8_t)0x52)
#define DMA_FLEXIBLE_TIM4_CH4       ((uint8_t)0x53)
#define DMA_FLEXIBLE_TIM5_TRIG      ((uint8_t)0x55)
#define DMA_FLEXIBLE_TIM5_UP        ((uint8_t)0x57)
#define DMA_FLEXIBLE_TIM5_CH1       ((uint8_t)0x58)
#define DMA_FLEXIBLE_TIM5_CH2       ((uint8_t)0x59)
#define DMA_FLEXIBLE_TIM5_CH3       ((uint8_t)0x5A)
#define DMA_FLEXIBLE_TIM5_CH4       ((uint8_t)0x5B)
#define DMA_FLEXIBLE_TIM6_UP        ((uint8_t)0x5F)
#define DMA_FLEXIBLE_TIM7_UP        ((uint8_t)0x67)
#define DMA_FLEXIBLE_TIM8_TRIG      ((uint8_t)0x6D)
#define DMA_FLEXIBLE_TIM8_COM       ((uint8_t)0x6E)
#define DMA_FLEXIBLE_TIM8_UP        ((uint8_t)0x6F)
#define DMA_FLEXIBLE_TIM8_CH1       ((uint8_t)0x70)
#define DMA_FLEXIBLE_TIM8_CH2       ((uint8_t)0x71)
#define DMA_FLEXIBLE_TIM8_CH3       ((uint8_t)0x72)
#define DMA_FLEXIBLE_TIM8_CH4       ((uint8_t)0x73)

