RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_dma.h
/** @defgroup DMA_peripheral_data_size
  * @{
  */

#define DMA_PERIPHERALDATAWIDTH_BYTE        ((uint32_t)0x00000000)
#define DMA_PERIPHERALDATAWIDTH_HALFWORD    ((uint32_t)0x00000100)
#define DMA_PERIPHERALDATAWIDTH_WORD        ((uint32_t)0x00000200)
#define IS_DMA_PERIPHERAL_DATA_WIDTH(WIDTH) (((WIDTH) == DMA_PERIPHERALDATAWIDTH_BYTE) || \
                                             ((WIDTH) == DMA_PERIPHERALDATAWIDTH_HALFWORD) || \
                                             ((WIDTH) == DMA_PERIPHERALDATAWIDTH_WORD))
/**
  * @}
  */

/** @defgroup DMA_memory_data_size
  * @{
  */

#define DMA_MEMORYDATAWIDTH_BYTE            ((uint32_t)0x00000000)
#define DMA_MEMORYDATAWIDTH_HALFWORD        ((uint32_t)0x00000400)
#define DMA_MEMORYDATAWIDTH_WORD            ((uint32_t)0x00000800)
#define IS_DMA_MEMORY_DATA_WIDTH(WIDTH)     (((WIDTH) == DMA_MEMORYDATAWIDTH_BYTE) || \
                                             ((WIDTH) == DMA_MEMORYDATAWIDTH_HALFWORD) || \
                                             ((WIDTH) == DMA_MEMORYDATAWIDTH_WORD))
/**
  * @}
  */

/** @defgroup DMA_circular_normal_mode
  * @{
  */

#define DMA_MODE_CIRCULAR                   ((uint32_t)0x00000020)
#define DMA_MODE_NORMAL                     ((uint32_t)0x00000000)
#define IS_DMA_MODE(MODE)                   (((MODE) == DMA_MODE_CIRCULAR) || ((MODE) == DMA_MODE_NORMAL))
/**
  * @}
  */

/** @defgroup DMA_priority_level
  * @{
  */

#define DMA_PRIORITY_VERYHIGH               ((uint32_t)0x00003000)
#define DMA_PRIORITY_HIGH                   ((uint32_t)0x00002000)
#define DMA_PRIORITY_MEDIUM                 ((uint32_t)0x00001000)
#define DMA_PRIORITY_LOW                    ((uint32_t)0x00000000)
#define IS_DMA_PRIORITY(PRIORITY)           (((PRIORITY) == DMA_PRIORITY_VERYHIGH) || \
                                             ((PRIORITY) == DMA_PRIORITY_HIGH) || \
                                             ((PRIORITY) == DMA_PRIORITY_MEDIUM) || \
                                             ((PRIORITY) == DMA_PRIORITY_LOW))
/**
  * @}
  */

/** @defgroup DMA_memory_to_memory
  * @{
  */

#define DMA_MEMTOMEM_ENABLE                 ((uint32_t)0x00004000)
#define DMA_MEMTOMEM_DISABLE                ((uint32_t)0x00000000)
#define IS_DMA_MTOM_STATE(STATE)            (((STATE) == DMA_MEMTOMEM_ENABLE) || ((STATE) == DMA_MEMTOMEM_DISABLE))

/**
  * @}
  */

/** @defgroup DMA_interrupts_definition
  * @{
  */

#define DMA_INT_TC                          ((uint32_t)0x00000002)
#define DMA_INT_HT                          ((uint32_t)0x00000004)
#define DMA_INT_ERR                         ((uint32_t)0x00000008)
#define IS_DMA_CONFIG_INT(INT)              ((((INT) & 0xFFFFFFF1) == 0x00) && ((INT) != 0x00))

#define DMA1_INT_GL1                        ((uint32_t)0x00000001)
#define DMA1_INT_TC1                        ((uint32_t)0x00000002)
#define DMA1_INT_HT1                        ((uint32_t)0x00000004)
#define DMA1_INT_ERR1                       ((uint32_t)0x00000008)
#define DMA1_INT_GL2                        ((uint32_t)0x00000010)
#define DMA1_INT_TC2                        ((uint32_t)0x00000020)
#define DMA1_INT_HT2                        ((uint32_t)0x00000040)
#define DMA1_INT_ERR2                       ((uint32_t)0x00000080)
#define DMA1_INT_GL3                        ((uint32_t)0x00000100)
#define DMA1_INT_TC3                        ((uint32_t)0x00000200)
#define DMA1_INT_HT3                        ((uint32_t)0x00000400)
#define DMA1_INT_ERR3                       ((uint32_t)0x00000800)
#define DMA1_INT_GL4                        ((uint32_t)0x00001000)
#define DMA1_INT_TC4                        ((uint32_t)0x00002000)
#define DMA1_INT_HT4                        ((uint32_t)0x00004000)
#define DMA1_INT_ERR4                       ((uint32_t)0x00008000)
#define DMA1_INT_GL5                        ((uint32_t)0x00010000)
#define DMA1_INT_TC5                        ((uint32_t)0x00020000)
#define DMA1_INT_HT5                        ((uint32_t)0x00040000)
#define DMA1_INT_ERR5                       ((uint32_t)0x00080000)
#define DMA1_INT_GL6                        ((uint32_t)0x00100000)
#define DMA1_INT_TC6                        ((uint32_t)0x00200000)
#define DMA1_INT_HT6                        ((uint32_t)0x00400000)
#define DMA1_INT_ERR6                       ((uint32_t)0x00800000)
#define DMA1_INT_GL7                        ((uint32_t)0x01000000)
#define DMA1_INT_TC7                        ((uint32_t)0x02000000)
#define DMA1_INT_HT7                        ((uint32_t)0x04000000)
#define DMA1_INT_ERR7                       ((uint32_t)0x08000000)

#define DMA2_INT_GL1                        ((uint32_t)0x10000001)
#define DMA2_INT_TC1                        ((uint32_t)0x10000002)
#define DMA2_INT_HT1                        ((uint32_t)0x10000004)
#define DMA2_INT_ERR1                       ((uint32_t)0x10000008)
#define DMA2_INT_GL2                        ((uint32_t)0x10000010)
#define DMA2_INT_TC2                        ((uint32_t)0x10000020)
#define DMA2_INT_HT2                        ((uint32_t)0x10000040)
#define DMA2_INT_ERR2                       ((uint32_t)0x10000080)
#define DMA2_INT_GL3                        ((uint32_t)0x10000100)
#define DMA2_INT_TC3                        ((uint32_t)0x10000200)
#define DMA2_INT_HT3                        ((uint32_t)0x10000400)
#define DMA2_INT_ERR3                       ((uint32_t)0x10000800)
#define DMA2_INT_GL4                        ((uint32_t)0x10001000)
#define DMA2_INT_TC4                        ((uint32_t)0x10002000)
#define DMA2_INT_HT4                        ((uint32_t)0x10004000)
#define DMA2_INT_ERR4                       ((uint32_t)0x10008000)
#define DMA2_INT_GL5                        ((uint32_t)0x10010000)
#define DMA2_INT_TC5                        ((uint32_t)0x10020000)
#define DMA2_INT_HT5                        ((uint32_t)0x10040000)
#define DMA2_INT_ERR5                        ((uint32_t)0x10080000)

#define IS_DMA_CLEAR_INT(INT)               (((((INT) & 0xF0000000) == 0x00) || (((INT) & 0xEFF00000) == 0x00)) && ((INT) != 0x00))

#define IS_DMA_GET_INT(INT)                 (((INT) == DMA1_INT_GL1) || ((INT) == DMA1_INT_TC1) || \
                                             ((INT) == DMA1_INT_HT1) || ((INT) == DMA1_INT_ERR1) || \
                                             ((INT) == DMA1_INT_GL2) || ((INT) == DMA1_INT_TC2) || \
                                             ((INT) == DMA1_INT_HT2) || ((INT) == DMA1_INT_ERR2) || \
                                             ((INT) == DMA1_INT_GL3) || ((INT) == DMA1_INT_TC3) || \
                                             ((INT) == DMA1_INT_HT3) || ((INT) == DMA1_INT_ERR3) || \
                                             ((INT) == DMA1_INT_GL4) || ((INT) == DMA1_INT_TC4) || \
                                             ((INT) == DMA1_INT_HT4) || ((INT) == DMA1_INT_ERR4) || \
                                             ((INT) == DMA1_INT_GL5) || ((INT) == DMA1_INT_TC5) || \
                                             ((INT) == DMA1_INT_HT5) || ((INT) == DMA1_INT_ERR5) || \
                                             ((INT) == DMA1_INT_GL6) || ((INT) == DMA1_INT_TC6) || \
                                             ((INT) == DMA1_INT_HT6) || ((INT) == DMA1_INT_ERR6) || \
                                             ((INT) == DMA1_INT_GL7) || ((INT) == DMA1_INT_TC7) || \
                                             ((INT) == DMA1_INT_HT7) || ((INT) == DMA1_INT_ERR7) || \
                                             ((INT) == DMA2_INT_GL1) || ((INT) == DMA2_INT_TC1) || \
                                             ((INT) == DMA2_INT_HT1) || ((INT) == DMA2_INT_ERR1) || \
                                             ((INT) == DMA2_INT_GL2) || ((INT) == DMA2_INT_TC2) || \
                                             ((INT) == DMA2_INT_HT2) || ((INT) == DMA2_INT_ERR2) || \
                                             ((INT) == DMA2_INT_GL3) || ((INT) == DMA2_INT_TC3) || \
                                             ((INT) == DMA2_INT_HT3) || ((INT) == DMA2_INT_ERR3) || \
                                             ((INT) == DMA2_INT_GL4) || ((INT) == DMA2_INT_TC4) || \
                                             ((INT) == DMA2_INT_HT4) || ((INT) == DMA2_INT_ERR4) || \
                                             ((INT) == DMA2_INT_GL5) || ((INT) == DMA2_INT_TC5) || \
                                             ((INT) == DMA2_INT_HT5) || ((INT) == DMA2_INT_ERR5))

/**
  * @}
  */

