RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_dma.h
/** @defgroup DMA_flags_definition
  * @{
  */
#define DMA1_FLAG_GL1                       ((uint32_t)0x00000001)
#define DMA1_FLAG_TC1                       ((uint32_t)0x00000002)
#define DMA1_FLAG_HT1                       ((uint32_t)0x00000004)
#define DMA1_FLAG_ERR1                      ((uint32_t)0x00000008)
#define DMA1_FLAG_GL2                       ((uint32_t)0x00000010)
#define DMA1_FLAG_TC2                       ((uint32_t)0x00000020)
#define DMA1_FLAG_HT2                       ((uint32_t)0x00000040)
#define DMA1_FLAG_ERR2                      ((uint32_t)0x00000080)
#define DMA1_FLAG_GL3                       ((uint32_t)0x00000100)
#define DMA1_FLAG_TC3                       ((uint32_t)0x00000200)
#define DMA1_FLAG_HT3                       ((uint32_t)0x00000400)
#define DMA1_FLAG_ERR3                      ((uint32_t)0x00000800)
#define DMA1_FLAG_GL4                       ((uint32_t)0x00001000)
#define DMA1_FLAG_TC4                       ((uint32_t)0x00002000)
#define DMA1_FLAG_HT4                       ((uint32_t)0x00004000)
#define DMA1_FLAG_ERR4                      ((uint32_t)0x00008000)
#define DMA1_FLAG_GL5                       ((uint32_t)0x00010000)
#define DMA1_FLAG_TC5                       ((uint32_t)0x00020000)
#define DMA1_FLAG_HT5                       ((uint32_t)0x00040000)
#define DMA1_FLAG_ERR5                      ((uint32_t)0x00080000)
#define DMA1_FLAG_GL6                       ((uint32_t)0x00100000)
#define DMA1_FLAG_TC6                       ((uint32_t)0x00200000)
#define DMA1_FLAG_HT6                       ((uint32_t)0x00400000)
#define DMA1_FLAG_ERR6                      ((uint32_t)0x00800000)
#define DMA1_FLAG_GL7                       ((uint32_t)0x01000000)
#define DMA1_FLAG_TC7                       ((uint32_t)0x02000000)
#define DMA1_FLAG_HT7                       ((uint32_t)0x04000000)
#define DMA1_FLAG_ERR7                      ((uint32_t)0x08000000)

#define DMA2_FLAG_GL1                       ((uint32_t)0x10000001)
#define DMA2_FLAG_TC1                       ((uint32_t)0x10000002)
#define DMA2_FLAG_HT1                       ((uint32_t)0x10000004)
#define DMA2_FLAG_ERR1                      ((uint32_t)0x10000008)
#define DMA2_FLAG_GL2                       ((uint32_t)0x10000010)
#define DMA2_FLAG_TC2                       ((uint32_t)0x10000020)
#define DMA2_FLAG_HT2                       ((uint32_t)0x10000040)
#define DMA2_FLAG_ERR2                      ((uint32_t)0x10000080)
#define DMA2_FLAG_GL3                       ((uint32_t)0x10000100)
#define DMA2_FLAG_TC3                       ((uint32_t)0x10000200)
#define DMA2_FLAG_HT3                       ((uint32_t)0x10000400)
#define DMA2_FLAG_ERR3                      ((uint32_t)0x10000800)
#define DMA2_FLAG_GL4                       ((uint32_t)0x10001000)
#define DMA2_FLAG_TC4                       ((uint32_t)0x10002000)
#define DMA2_FLAG_HT4                       ((uint32_t)0x10004000)
#define DMA2_FLAG_ERR4                      ((uint32_t)0x10008000)
#define DMA2_FLAG_GL5                       ((uint32_t)0x10010000)
#define DMA2_FLAG_TC5                       ((uint32_t)0x10020000)
#define DMA2_FLAG_HT5                       ((uint32_t)0x10040000)
#define DMA2_FLAG_ERR5                      ((uint32_t)0x10080000)

#define IS_DMA_CLEAR_FLAG(FLAG)             (((((FLAG) & 0xF0000000) == 0x00) || (((FLAG) & 0xEFF00000) == 0x00)) && ((FLAG) != 0x00))

#define IS_DMA_GET_FLAG(FLAG)               (((FLAG) == DMA1_FLAG_GL1) || ((FLAG) == DMA1_FLAG_TC1) || \
                                             ((FLAG) == DMA1_FLAG_HT1) || ((FLAG) == DMA1_FLAG_ERR1) || \
                                             ((FLAG) == DMA1_FLAG_GL2) || ((FLAG) == DMA1_FLAG_TC2) || \
                                             ((FLAG) == DMA1_FLAG_HT2) || ((FLAG) == DMA1_FLAG_ERR2) || \
                                             ((FLAG) == DMA1_FLAG_GL3) || ((FLAG) == DMA1_FLAG_TC3) || \
                                             ((FLAG) == DMA1_FLAG_HT3) || ((FLAG) == DMA1_FLAG_ERR3) || \
                                             ((FLAG) == DMA1_FLAG_GL4) || ((FLAG) == DMA1_FLAG_TC4) || \
                                             ((FLAG) == DMA1_FLAG_HT4) || ((FLAG) == DMA1_FLAG_ERR4) || \
                                             ((FLAG) == DMA1_FLAG_GL5) || ((FLAG) == DMA1_FLAG_TC5) || \
                                             ((FLAG) == DMA1_FLAG_HT5) || ((FLAG) == DMA1_FLAG_ERR5) || \
                                             ((FLAG) == DMA1_FLAG_GL6) || ((FLAG) == DMA1_FLAG_TC6) || \
                                             ((FLAG) == DMA1_FLAG_HT6) || ((FLAG) == DMA1_FLAG_ERR6) || \
                                             ((FLAG) == DMA1_FLAG_GL7) || ((FLAG) == DMA1_FLAG_TC7) || \
                                             ((FLAG) == DMA1_FLAG_HT7) || ((FLAG) == DMA1_FLAG_ERR7) || \
                                             ((FLAG) == DMA2_FLAG_GL1) || ((FLAG) == DMA2_FLAG_TC1) || \
                                             ((FLAG) == DMA2_FLAG_HT1) || ((FLAG) == DMA2_FLAG_ERR1) || \
                                             ((FLAG) == DMA2_FLAG_GL2) || ((FLAG) == DMA2_FLAG_TC2) || \
                                             ((FLAG) == DMA2_FLAG_HT2) || ((FLAG) == DMA2_FLAG_ERR2) || \
                                             ((FLAG) == DMA2_FLAG_GL3) || ((FLAG) == DMA2_FLAG_TC3) || \
                                             ((FLAG) == DMA2_FLAG_HT3) || ((FLAG) == DMA2_FLAG_ERR3) || \
                                             ((FLAG) == DMA2_FLAG_GL4) || ((FLAG) == DMA2_FLAG_TC4) || \
                                             ((FLAG) == DMA2_FLAG_HT4) || ((FLAG) == DMA2_FLAG_ERR4) || \
                                             ((FLAG) == DMA2_FLAG_GL5) || ((FLAG) == DMA2_FLAG_TC5) || \
                                             ((FLAG) == DMA2_FLAG_HT5) || ((FLAG) == DMA2_FLAG_ERR5))
/**
  * @}
  */

/** @defgroup DMA_Buffer_Size
  * @{
  */

#define IS_DMA_BUFFER_SIZE(SIZE)            (((SIZE) >= 0x1) && ((SIZE) < 0x10000))

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup DMA_Exported_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup DMA_Exported_Functions
  * @{
  */

void DMA_Reset(DMA_Channel_Type* DMAy_Channelx);
void DMA_Init(DMA_Channel_Type* DMAy_Channelx, DMA_InitType* DMA_InitStruct);
void DMA_DefaultInitParaConfig(DMA_InitType* DMA_InitStruct);
void DMA_ChannelEnable(DMA_Channel_Type* DMAy_Channelx, FunctionalState NewState);
void DMA_INTConfig(DMA_Channel_Type* DMAy_Channelx, uint32_t DMA_INT, FunctionalState NewState);
void DMA_SetCurrDataCounter(DMA_Channel_Type* DMAy_Channelx, uint16_t DataNumber);
uint16_t DMA_GetCurrDataCounter(DMA_Channel_Type* DMAy_Channelx);
FlagStatus DMA_GetFlagStatus(uint32_t DMAy_FLAG);
void DMA_ClearFlag(uint32_t DMAy_FLAG);
ITStatus DMA_GetITStatus(uint32_t DMAy_INT);
void DMA_ClearITPendingBit(uint32_t DMAy_INT);
void DMA_Flexible_Config(DMA_Type *DMAx,uint8_t Flex_Channelx,uint8_t Hardware_ID);

#ifdef __cplusplus
}
#endif

#endif /*__AT32F4xx_DMA_H */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


